var titles=['热搜榜','郑州榜','民生榜','财经榜']
var lists = [
    [
        "为和平发展贡献青春力量",
        "预计海啸17-20时到达浙沪沿海海域",
        "俄罗斯强震 第一波海啸已抵达日本",
        "暴雨洪水过后 这些法律问题需知晓",
        "俄罗斯堪察加8.7级地震 多国海啸预警",
        "上海浙江将遭海啸台风双重灾害影响",
        "爱康将起诉体检10年未发现患癌女子",
        "足坛反腐18人全部获刑 最高被判无期",
        "知名金融巨头女高管遭枪击身亡",
        "上海已转移安置28万人",
        "哀牢山发现7株冥界之花",
        "网民蹭流量编造着火谣言被行拘",
        "俄强震将致中国局地受灾害性影响",
        "成人安抚奶嘴走红",
        "公司浴室起火致26死 13人被提起公诉",
        "储户在银行存35万 取款时被清零了",
        "日本首相石破茂呼吁迅速避难",
        "日本多地观测到海啸 局地海水逆流",
        "孕妇被表姐夫诱骗 在泰缅边境失联",
        "中国佛教协会官网撤下释永信的信息",
        "刘宇宁祝绪丹否认恋情",
        "海啸淹没2000人居住的俄港口城镇",
        "医生回应得荨麻疹女子在皮肤上划字",
        "iPhone 17 Pro橙色机模曝光",
        "演唱会偷情事件男主起诉Coldplay",
        "落马贪官一副眼镜4.3万元公开拍卖",
        "日本部分地区或出现3米海啸",
        "陈佩斯点评儿子连用3个一般",
        "堪察加强震：数米高海啸冲毁建筑",
        "每孩1年3600元育儿补贴影响有多大",
        "牛弹琴：特朗普要对普京下狠手了"
    ],
    [
        "体感超50℃ 河南将迎王炸级热浪",
        "印乐法师任少林寺住持",
        "每天10点开抢 1分钱乘公交地铁",
        "郑州上半年GDP增长5.2％",
        "高空飞椅游客自转 园方回应：正常设计",
        "郑州银行怒告最高学历楼盘开发商",
        "郑州主播每天喝四杯冰奶茶突然失声",
        "小伙打车100多公里假装扫码后逃单",
        "95后土木工程研究生卖创意烧饼火出圈",
        "五年不换筷子 女子胃中发现黄曲霉素"
    ],
    [
        "俄强震将致中国局地受灾害性影响",
        "成人安抚奶嘴走红",
        "上海已转移安置28万人",
        "预计海啸17-20时到达浙沪沿海海域",
        "上海浙江将遭海啸台风双重灾害影响",
        "爱康将起诉体检10年未发现患癌女子",
        "公司浴室起火致26死 13人被提起公诉",
        "储户在银行存35万 取款时被清零了",
        "18人承德避暑遇山洪 4辆车全被冲走",
        "孕妇被表姐夫诱骗 在泰缅边境失联",
        "医生回应得荨麻疹女子在皮肤上划字",
        "每孩1年3600元育儿补贴影响有多大",
        "酒企在啤酒中添加类似伟哥物质",
        "成都凌晨发生车祸致1死3伤",
        "竹节草将二次登陆 浙江111条预警连发",
        "台风竹节草致宁波多地积水",
        "暴雨中怀柔小卖部老板娘真暖心",
        "自然资源部启动海洋灾害二级应急响应",
        "救百余人铲车司机：说我是英雄过誉了",
        "成都地铁官方回应防走光设计",
        "上海浦东内河水位已预降至2.4米以下",
        "华侨城前员工称投8万拿回9000",
        "男子吃海鲜火锅后感染甲肝",
        "国家药监局原副局长陈时飞被开除党籍",
        "台风竹节草在浙江舟山登陆",
        "安徽省政协原副主席周喜安被双开",
        "江西回应树林发现大量被丢弃药品",
        "记者探访北京密云葡萄园村",
        "竹节草登陆 上海地铁暂不停运",
        "宝宝刚爬离危险区域 风扇突然坠落"
    ],
    [
        "知名金融巨头女高管遭枪击身亡",
        "iPhone 17 Pro橙色机模曝光",
        "茅台八仙之一冯小宁被公开除名",
        "育儿补贴新政引爆市场",
        "曝华为Mate 80支持eSIM",
        "科学家培育出新型全脑类器官",
        "全新小鹏P7首秀定档8月6日",
        "马斯克：与三星电子会长通话讨论合作",
        "奥迪上半年利润下滑超三成",
        "创新药概念反复活跃 辰欣药业8天5板",
        "居然智家盘中触及涨停",
        "银行股反弹 邮储银行涨逾2%",
        "问止中医再度递表港交所",
        "理想汽车跌逾11%",
        "华为重回世界500强前100",
        "两市融资余额增加152.71亿元",
        "人民币兑美元中间价上调70点",
        "蓝箭航天启动A股IPO辅导",
        "沪市融资余额超1万亿 创近十年新高",
        "苹果1个月失去4名AI研究员",
        "猪肉概念活跃 光明肉业涨逾6%",
        "鸿蒙5终端数突破1000万",
        "全球市场将进入超级72小时",
        "iOS18.6正式版发布",
        "广发证券发行20亿元短期公司债券",
        "芯片股延续强势 东芯股份涨超10%",
        "港股半导体股走低 上海复旦跌超6%",
        "新加坡金管局维持货币政策不变",
        "国产航母板块短线拉升 北斗星通涨停",
        "影视院线板块短线拉升 金逸影视涨停"
    ]
]
var ul=document.querySelector('.title-list')
for(var i=0; i<titles.length; i++){
    ul.innerHTML+=`
    <li data-index=${i}><span>${titles[i]}</span></li>
    `
}
var lists=document.querySelector('.lists')
var ul1=document.querySelector('.list-one')
for(var i=0;i<lists.length; i++){
    lists.innerHTML+=`
    <ul class="list-one">

    </ul>
    `
}
